tap "bell-sw/liberica"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
brew "act"
brew "python@3.12"
brew "harfbuzz"
brew "aider"
brew "ansible"
brew "bash"
brew "bat"
brew "openjdk"
brew "bfg"
brew "binutils"
brew "p7zip"
brew "binwalk"
brew "boost"
brew "boost-mpi"
brew "btop"
brew "cmake"
brew "coreutils"
brew "cython"
brew "docker-machine"
brew "eigen"
brew "eza"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "httpie"
brew "imagemagick"
brew "jupyterlab"
brew "llvm"
brew "lld"
brew "make"
brew "mas"
brew "metis"
brew "moreutils"
brew "neovim"
brew "nmap"
brew "ollama"
brew "openssh"
brew "pipx"
brew "speedtest-cli"
brew "starship"
brew "tectonic"
brew "tmux"
brew "tree"
brew "unar"
brew "vim"
brew "zlib"
brew "zoxide"
brew "felixkratz/formulae/sketchybar"
cask "aerospace"
cask "alacritty"
cask "audio-hijack"
cask "docker"
cask "font-hack-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "liberica-jdk15-full"
cask "liberica-jdk22-full"
cask "linearmouse"
cask "prismlauncher"
cask "sf-symbols"
cask "virtualbox"
mas "AdBlock Pro", id: 1018301773
mas "Boop", id: 1518425043
mas "Codye", id: 1516894961
mas "Color Picker", id: 1545870783
mas "Gifski", id: 1351639930
mas "Goodnotes", id: 1444383602
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Key Codes", id: 414568915
mas "Keynote", id: 409183694
mas "Linearity Curve", id: 1219074514
mas "Linearity Move", id: 6443677011
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 409201541
mas "Tomito", id: 1526042938
mas "Type to Learn", id: 1401007562
mas "Webcam Settings", id: 533696630
vscode "abax.nearest-icons"
vscode "actboy168.lua-debug"
vscode "be5invis.toml"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"

vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"

vscode "vscodevim.vim"
